import { Card, CardContent, CardHeader } from "@mui/material";

export const Dashboard = () => (
    <Card>
        <CardHeader title="用户隐私协议" />
        <CardContent>
             <p>欢迎使用TTP(赛力斯罕见病)检测系统软件！在开始使用本软件之前，请仔细阅读并同意以下隐私协议。本协议旨在说明我们如何收集、使用和保护您的个人信息。通过使用本软件，您表示同意本隐私协议的条款。</p>
             <p><strong>1. 收集的信息</strong></p>
             <p><strong>1.1 个人信息：</strong></p>
             <p> 在您使用本软件的过程中，我们可能会收集您的个人信息，包括但不限于姓名、电子邮件地址、联系方式等。</p>
             <p><strong>  1.2 非个人信息：</strong></p> 
             <p> 我们还可能收集与您的身份无关的信息，如使用习惯、设备信息、操作系统类型等。</p>  
             <p><strong>2. 信息的使用</strong></p> 
             <p><strong>2.1 提供服务：</strong></p>
             <p>我们收集的信息主要用于提供、维护、改进和定制本软件的服务。</p> 
             <p><strong>2.2 通知和沟通：</strong></p>  
             <p>我们可能会使用您的联系信息向您发送相关通知，包括但不限于服务更新、安全通知等。</p>
             <p><strong>2.3 改进用户体验：</strong></p>  
             <p>我们可能会使用收集的信息来了解用户的偏好，从而改进和个性化用户体验。</p>
             <p><strong>3. 信息的分享与披露</strong></p> 
             <p><strong>3.1 第三方服务提供商：</strong></p>  
             <p>我们可能会与第三方服务提供商合作，以提供本软件的某些功能。在这种情况下，我们可能会与其分享必要的信息。</p>
             <p><strong>3.2 法律要求：</strong></p> 
             <p> 我们可能会在法律要求的情况下披露您的信息，以遵守适用的法律法规。</p>
             <p><strong>4. 信息的安全</strong></p> 
             <p>我们将采取合理的技术和组织措施来保护您的个人信息，以防止未经授权的访问、使用、披露、修改、损失或破坏。</p>
             <p><strong>5. Cookie和类似技术</strong></p> 
             <p>我们可能会使用Cookie和类似技术来收集和存储信息。您可以通过浏览器设置管理Cookie的使用。</p>
             <p><strong>6. 用户的权利</strong></p> 
             <p>您有权访问、更正、删除您的个人信息。如有任何疑问或需要协助，请通过下文提供的联系方式与我们联系。</p>
             <p><strong>7. 隐私政策的变更</strong></p> 
             <p>我们保留在任何时候修改本隐私协议的权利。变更将在本软件上发布并生效。请定期查看隐私协议的更新。</p>
            <p>如果您对本隐私协议有任何疑问、意见或建议，请通过以下联系方式与我们取得联系：</p>
            <p>感谢您阅读我们的隐私协议，希望您享受使用我们的软件！</p>
            <p><strong>8. 联系我们</strong></p>
            <p>如果您对本隐私协议有任何疑问、意见或建议，请通过以下联系方式与我们取得联系：</p>
            <p>感谢您阅读我们的隐私协议，希望您享受使用我们的软件！</p>

        </CardContent>
    </Card>
);